/* eslint-disable no-unused-vars */

import Language from '@/lang/langInterface'

/* eslint-enable no-unused-vars */

var ta = <Language> {
    // Initial page
    getting_started: 'தொடங்குக',
    create_new: 'புதிய வாலட்டை உருவாக்கு',
    create_subtext: "நாங்கள் உங்களுக்காக ஒரு புதிய வாலட்டை உருவாக்குவோம், எனவே நீங்கள் பிட்காயினை பயன்படுத்தத் தொடங்கலாம்.",
    restore_existing: 'ஏற்கனவே இருக்கும் வாலட்டை மீட்டெடுக்கவும்',
    restore_subtext: "நீங்கள் ஏற்கனவே ஒரு வாலட்டை வைத்திருக்கிறீர்கள், அதை மீட்டெடுக்க உங்கள் மீட்பு சொற்களை நீங்கள்  பயன்படுத்த வேண்டும்.",
    change_language: 'மொழியை மாற்று',
    choose_language: 'மொழியை தேர்வுசெய்க',

    // Create page
    seed_phrase: "மீட்பு சொற்கள்",
    wrote_it_down: 'நான் அதை எழுதிக்கொண்டேன்',
    generate: 'உருவாக்கு',
    warning: 'எச்சரிக்கை',
    we_will_generate: 'உங்களுக்காக 12 மீட்பு சொற்களை நாங்கள் உருவாக்குவோம்.',
    warning_text_1: "சொற்களை சரியான வரிசையில் எழுதி, அதை ஆஃப்லைன் மூலமாக பாதுகாப்பாக வைத்திருங்கள். இந்த சொற்களை நீங்கள் இழந்தால், உங்கள் பிட்காயினை பயன்படுத்த முடியாது.",
    warning_text_2: "இந்த மீட்பு சொற்கள் உங்கள் வாலட்டை மீட்டெடுக்க பயன்படும். சொற்களை எழுதி ஆஃப்லைனில் பாதுகாப்பாக வைத்திருங்கள்.",
    write_it_down: 'அதை எழுதி வைக்கவும்',
    keep_it_safe: 'அதை பாதுகாப்பாக வைக்கவும்',
    do_not_lose_it: 'அதை இழக்காதீர்கள்',
    have_saved: 'நான் எனது மீட்பு சொற்களை பாதுகாப்பாக எழுதி வைத்துள்ளேன்.',

    // Restore page
    restore_notice: 'உங்கள் வாலட்டை மீட்டமைக்க உங்கள் மீட்பு சொற்களை உள்ளிடவும்.',
    restore_warning: 'நீங்கள் உள்ளிட்ட மீட்பு சொற்கள் தவறானவை. சொற்களை சரியாக உச்சரிக்க வேண்டும் மற்றும் பெரிய எழுத்துக்கள் இருக்கக்கூடாது.',
    restoring: 'மீட்டமைக்கப்படுகின்றன...',

    // Wallet home
    refresh: 'புதுப்பி',
    overview: 'கண்ணோட்டம்',
    send: 'அனுப்பு',
    receive: 'பெறு',
    settings: 'அமைப்பு',
    amount_to_send: 'அனுப்ப வேண்டிய தொகை',
    not_enough_balance: 'அந்த தொகையை அனுப்ப போதுமான பேலன்ஸ் இல்லை',
    send_max: 'அதிகபட்சமாக அனுப்பு',
    amount: 'தொகை',
    miner_fee: 'வலையமைப்புக் கட்டணம்',
    total: 'மொத்தம்',
    confirmation: 'உறுதிப்படுத்தல்',
    they_receive: 'அவர்கள் பெறுகிறார்கள்',
    recepient: 'பெறுநர்',
    sending: 'அனுப்பப்படுகிறது...',
    are_you_sure: 'இந்த பரிவர்த்தனையை அனுப்ப விரும்புகிறீர்களா?',
    im_sure: "ஆம் நான் உறுதியாக இருக்கிறேன், அனுப்பு",
    seed_modal: 'மீட்பு சொற்கள்',
    transaction: 'பரிவர்த்தனை',
    transactions: 'பரிவர்த்தனைகள்',
    buy_bitcoin: 'பிட்காயின் வாங்கு',

    // Pagination
    page: 'பக்கம்', // Displayed as 'Page 1 of 1'
    of: 'of',

    // Overview
    total_balance: "மொத்த பேலன்ஸ்",
    no_transactions: "நீங்கள் இதுவரை எந்த பரிவர்த்தனையும் செய்ததில்லை",
    what_to_do: "நீங்கள் என்ன செய்ய விரும்புகிறீர்கள்?",
    date: 'தேதி',
    status: 'நிலை',
    processing: 'செயலாக்கம்',
    unconfirmed: 'உறுதிப்படுத்தப்படவில்லை',
    complete: 'முழுமை',

    // Send
    send_to: 'பிட்காயின் (BTC) முகவரிகளுக்கு மட்டும் அனுப்பவும்',
    bitcoin_address: 'பிட்காயின் முகவரி',
    address: 'முகவரி',
    low_priority: 'குறைந்த முன்னுரிமை',
    standard: 'நிலையானது',
    important: 'முக்கியமானது',
    low_priority_desc: "நீங்கள் கட்டணத்தை குறைவாகவே செலுத்துகிறீர்கள், ஆனால் நீங்கள் இதை குறைந்த முன்னுரிமை பரிவர்த்தனையாக கருதுகிறீர்கள் மற்றும் இதனை உறுதிப்படுத்த நீண்ட நேரம் காத்திருப்பதைப் நீங்கள் பொருட்டாக நினைக்கவில்லை.",
    standard_desc: "இது மிதமான ஒரு கட்டணத்தைப் பயன்படுத்தும், அதிக நெரிசல் காலங்களில் இது நீண்ட உறுதிப்படுத்தல் நேரத்திற்கு வழிவகுக்கும், ஆனால் இவை அரிதானவை.",
    important_desc: "30 நிமிட இலக்கிற்குள் உறுதிப்படுத்த பிரீமியம் கட்டணத்தைப் பயன்படுத்துகிறது, இது ஒரு அதிக முன்னுரிமை பரிவர்த்தனை மற்றும் இது விரைவாக உறுதிப்படுத்தப்பட வேண்டும்.",
    not_enough: "அந்தத் தொகையை அனுப்பவும், வலையமைப்புக் கட்டணத்தை செலுத்தவும் உங்களிடம் போதுமான தொகை இல்லை. அதற்கு பதிலாக அதிகபட்சமாக அனுப்பு என்ற பட்டனை அழுத்தி உங்கள் முழு பேலன்ஸை அனுப்ப முயற்சிக்கவும்.",
    dust_error: "நீங்கள் அனுப்ப முயற்சிக்கும் தொகையானது பிட்காயின் வலையமைப்பு செயலாக்க மிகவும் சிறியது.",
    bitcoin_network_fee: "பிட்காயின் வலையமைப்புக் கட்டணம்",

    // Receive
    receive_only: 'பிட்காயின் மட்டுமே பெறவும்',
    wallet_address: 'வாலட் முகவரி',
    address_below: 'கீழே உள்ள முகவரிக்கு',

    // Settings
    show_seed: 'மீட்பு',
    language: 'மொழி',
    currency: 'நாணயம்',
    exit_wallet: 'வாலட்டை விட்டு வெளியேறு',

    // Buttons
    back_button: 'முன்',
    restore_button: 'மீட்டமைத்தல்',
    next_button: 'பின்',
    ok_button: 'ஓகே',
    copy_button: 'நகல்',
    save_button: 'சேமி',

    // Notification
    notification_title: 'உள்வரும் பரிவர்த்தனை',

    // Exit wallet
    exit_text: 'இது உங்கள் வாலாட்டின் கோப்புகளையும், பரிவர்த்தனைகளின் அனைத்து பதிவுகளையும் அழிக்கும். உங்கள் வாலட்டை மீட்டெடுப்பதற்கான ஒரே வழி உங்கள் மீட்பு சொற்கள் மூலமாகவே நடக்கும்',
    exit_are_you_sure: 'இந்த வாலட்டை அழித்துவிட்டு வெளியேற விரும்புகிறீர்களா?',
    exit_label_text: 'ஆம், இந்த வாலட்டை அழி',
    exit_delete: 'அழி'
}

export default ta
